In [1]:
# Practical No. 1
# Data Science and Visualization
# Program by Tushar B. Kute, MITU Skillologies
'''Access an open source dataset “Titanic”.
Apply pre-processing techniques on the raw dataset.'''

'Access an open source dataset “Titanic”.\nApply pre-processing techniques on the raw dataset.'

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
pd.__version__

'1.2.3'

In [4]:
np.__version__

'1.20.1'

In [5]:
sns.__version__

'0.11.1'

In [6]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [7]:
dataset = sns.load_dataset('titanic')

In [8]:
dataset

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')

In [10]:
df

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [11]:
import os
os.getcwd()
os.chdir('/home/mitu/Documents')
#os.chdir('c:\\Users\\Documents\\Anaconda')
os.getcwd()

FileNotFoundError: [WinError 3] The system cannot find the path specified: '/home/mitu/Documents'

In [ ]:
df = pd.read_csv('titanic.csv')

In [ ]:
df

In [ ]:
df.columns

In [ ]:
df.shape

In [ ]:
dataset.shape

In [ ]:
dataset.columns

In [ ]:
df.head()

In [ ]:
dataset.head()

In [ ]:
df.tail()

In [ ]:
df.info()

In [ ]:
dataset.info()

In [ ]:
dataset.describe()

In [ ]:
df.describe()

In [ ]:
df.count()

In [ ]:
dataset.count()

In [ ]:
dataset.isnull().sum()

In [ ]:
dataset = dataset.drop('deck', axis = 1)

In [ ]:
dataset.isnull().sum()

In [ ]:
dataset['age'] = dataset['age'].fillna(dataset['age'].median())

In [ ]:
dataset.isnull().sum()

In [ ]:
dataset['embarked'].mode()[0]

In [ ]:
dataset['embark_town'].mode()[0]

In [ ]:
dataset['embarked'] = dataset['embarked'].fillna(
    dataset['embarked'].mode()[0])

In [ ]:
dataset['embark_town'] = dataset['embark_town'].fillna(
    dataset['embark_town'].mode()[0])

In [ ]:
dataset.isnull().sum()

In [ ]:
dataset.info()

In [ ]:
plt.hist(dataset['age']);

In [ ]:
dataset['age'].plot(kind='box')

In [ ]:
dataset['fare'].plot(kind='box')

In [ ]:
dataset.info()

In [ ]:
pd.get_dummies(dataset).head()

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
train, test = train_test_split(dataset,test_size=0.20)

In [ ]:
len(dataset)

In [ ]:
len(train)

In [ ]:
len(test)